/* css */

import React, {Component} from 'react';
import 'css/page/video_manage/index.scss';

import Back2Top from 'page/back2top/index';

export default class VideoManage extends Component{
    constructor(props) {
        super(props);
        this.state = {
            container: null
        }
    }
    componentDidMount() {

    }
    render() {
        return (<div  className="vm-wrap">
            <p>qwert</p>
            <p>关于myParabola:
                直接执行funParabola方法是不会产生运动的。因为，实际上funParabola执行返回的是一个对象。包含如下四个方法：

                mark 在目标元素以及移动元素上通过data-center自定义属性标记当前的中心坐标，如-234, -345. 此方法主要用在demo中，方便测试与预览用的。实际可能用途不大。
                position 重新获取元素的位置。在元素相对位置改变的时候，此方法很有用。否则会出现计算误差的情况。例如，页面布局是自适应或者响应式的，浏览器宽度变小了，两元素之间的距离变化了，此时需要执行下position，存储新的坐标位置。
                move 触发抛物线运动。
                init 初始化方法。实际上就是连续调用position, mark, move3个方法。
                demo点击页面任意位置触发抛物线运动就是这么触发的：</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>关于myParabola:
                直接执行funParabola方法是不会产生运动的。因为，实际上funParabola执行返回的是一个对象。包含如下四个方法：

                mark 在目标元素以及移动元素上通过data-center自定义属性标记当前的中心坐标，如-234, -345. 此方法主要用在demo中，方便测试与预览用的。实际可能用途不大。
                position 重新获取元素的位置。在元素相对位置改变的时候，此方法很有用。否则会出现计算误差的情况。例如，页面布局是自适应或者响应式的，浏览器宽度变小了，两元素之间的距离变化了，此时需要执行下position，存储新的坐标位置。
                move 触发抛物线运动。
                init 初始化方法。实际上就是连续调用position, mark, move3个方法。
                demo点击页面任意位置触发抛物线运动就是这么触发的：</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>123</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <p>456</p>
            <Back2Top container={'.content'} />
        </div>)
    }
}
